[
    {"title": "Mine Digital Exchange: Q1, 2020 [Report]","link": "https://hackernoon.com/mine-digital-exchange-q1-2020-report-p8fz32xu?source=rss", "excerpt":"For those who are not aware вЂ“ the gold to silver ratio is a historic comparison used as far back as Roman times (at 12:1) to determine the value of money (currency). The ratio had been highly important to the fortunes of Spain with their South American Gold, China with its Silver demand and Britain over the years.<p><a href="https://hackernoon.com/mine-digital-exchange-q1-2020-report-p8fz32xu?source=rss">Read the full story</a></p", "author":"Mine Digital"},
    {"title": "Inflations Won't Make Bitcoin Moon; Bailouts Will","link": "https://hackernoon.com/inflations-wont-make-bitcoin-moon-bailouts-will-vxdu32t7?source=rss", "excerpt":"According to social media, Coronavirus-related money-printing will send bitcoinвЂ™s price to the moon. вЂњBRRRRвЂќ go the machines, they say. The BRRRR meme is strong, but this financial panic will take a while to play out, with uncertain consequences for all of us. I would not bet on inflation, though we may get it.<p><a href="https://hackernoon.com/inflations-wont-make-bitcoin-moon-bailouts-will-vxdu32t7?source=rss">Read the full story</a></p>", "author":"Mark"},
    {"title": "Could Cryptocurrencies Ever Be Anything More Than the Creation of Money Out of Thin Air?","link": "https://hackernoon.com/could-cryptocurrencies-ever-be-anything-more-than-the-creation-of-money-out-of-thin-air-syls32h4?source=rss", "excerpt":"Something many people cannot seem to wrap their heads around is the concept of cryptocurrencies - how are cryptocurrencies created? What makes them valuable?В To understand this, letвЂ™s take a brief look back at the history of money.В В <p><a href="https://hackernoon.com/could-cryptocurrencies-ever-be-anything-more-than-the-creation-of-money-out-of-thin-air-syls32h4?source=rss">Read the full story</a></p>", "author":"Yun Han Wong "},
    {"title": "How To Deal with Global Crisis: A Better вЂњTruth MachineвЂќ","link": "https://hackernoon.com/how-to-deal-with-global-crisis-a-better-truth-machine-rdao32lq?source=rss", "excerpt":"One of the most terrifying parts of the current crisis is uncertainty. Uncertainty is one of the most terrifying things people can experience in general. Absolutely everyone I have spoken to is absolutely convinced that a lot of the information available is either biased, doctored or flat-out false. <p><a href="https://hackernoon.com/how-to-deal-with-global-crisis-a-better-truth-machine-rdao32lq?source=rss">Read the full story</a></p>", "author":"Grace Rachmany"},
]
